; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob5) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate6)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate4)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate1)
	(at pallet6 distributor0)
	(clear pallet6)
	(at pallet7 distributor2)
	(clear crate0)
	(at pallet8 distributor1)
	(clear pallet8)
	(at pallet9 distributor0)
	(clear pallet9)
	(at pallet10 depot2)
	(clear crate7)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 300)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 381)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 distributor2)
	(on crate0 pallet7)
	(= (weight crate0) 50)
	(at crate1 distributor2)
	(on crate1 pallet5)
	(= (weight crate1) 98)
	(at crate2 depot0)
	(on crate2 pallet0)
	(= (weight crate2) 33)
	(at crate3 depot2)
	(on crate3 pallet10)
	(= (weight crate3) 41)
	(at crate4 distributor0)
	(on crate4 pallet3)
	(= (weight crate4) 35)
	(at crate5 depot0)
	(on crate5 crate2)
	(= (weight crate5) 81)
	(at crate6 depot0)
	(on crate6 crate5)
	(= (weight crate6) 41)
	(at crate7 depot2)
	(on crate7 crate3)
	(= (weight crate7) 10)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet0)
		(on crate1 pallet6)
		(on crate2 crate5)
		(on crate3 pallet4)
		(on crate4 pallet2)
		(on crate5 pallet9)
		(on crate7 crate3)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist5 crate0 pallet7 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist5) (on crate0 pallet7)
   added: (lifting hoist5 crate0) (clear pallet7)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 7
2. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 1 to 11
   goals met: 1 of 7
3. (load hoist5 crate0 truck0 distributor2)
   deleted: (lifting hoist5 crate0)
   added: (in crate0 truck0) (available hoist5)
   changed: (current_load truck0) from 0 to 50
   goals met: 1 of 7
4. (lift hoist5 crate1 pallet5 distributor2)
   deleted: (at crate1 distributor2) (clear crate1) (available hoist5) (on crate1 pallet5)
   added: (lifting hoist5 crate1) (clear pallet5)
   changed: (fuel-cost) from 11 to 12
   goals met: 1 of 7
5. (load hoist5 crate1 truck0 distributor2)
   deleted: (lifting hoist5 crate1)
   added: (in crate1 truck0) (available hoist5)
   changed: (current_load truck0) from 50 to 148
   goals met: 1 of 7
6. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 12 to 22
   goals met: 1 of 7
7. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 22 to 32
   goals met: 1 of 7
8. (unload hoist3 crate1 truck0 distributor0)
   deleted: (in crate1 truck0) (available hoist3)
   added: (lifting hoist3 crate1)
   changed: (current_load truck0) from 148 to 50
   goals met: 1 of 7
9. (drop hoist3 crate1 pallet6 distributor0)
   deleted: (lifting hoist3 crate1) (clear pallet6)
   added: (available hoist3) (at crate1 distributor0) (clear crate1) (on crate1 pallet6)
   goals met: 2 of 7
10. (lift hoist3 crate4 pallet3 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist3) (on crate4 pallet3)
   added: (lifting hoist3 crate4) (clear pallet3)
   changed: (fuel-cost) from 32 to 33
   goals met: 2 of 7
11. (load hoist3 crate4 truck0 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck0) (available hoist3)
   changed: (current_load truck0) from 50 to 85
   goals met: 2 of 7
12. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 33 to 43
   goals met: 2 of 7
13. (unload hoist2 crate4 truck0 depot2)
   deleted: (in crate4 truck0) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck0) from 85 to 50
   goals met: 2 of 7
14. (drop hoist2 crate4 pallet2 depot2)
   deleted: (lifting hoist2 crate4) (clear pallet2)
   added: (available hoist2) (at crate4 depot2) (clear crate4) (on crate4 pallet2)
   goals met: 3 of 7
15. (lift hoist0 crate6 crate5 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 crate5)
   added: (lifting hoist0 crate6) (clear crate5)
   changed: (fuel-cost) from 43 to 44
   goals met: 3 of 7
16. (load hoist0 crate6 truck1 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck1) (available hoist0)
   changed: (current_load truck1) from 0 to 41
   goals met: 3 of 7
17. (lift hoist2 crate7 crate3 depot2)
   deleted: (at crate7 depot2) (clear crate7) (available hoist2) (on crate7 crate3)
   added: (lifting hoist2 crate7) (clear crate3)
   changed: (fuel-cost) from 44 to 45
   goals met: 2 of 7
18. (load hoist2 crate7 truck0 depot2)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck0) (available hoist2)
   changed: (current_load truck0) from 50 to 60
   goals met: 2 of 7
19. (lift hoist2 crate3 pallet10 depot2)
   deleted: (at crate3 depot2) (clear crate3) (available hoist2) (on crate3 pallet10)
   added: (lifting hoist2 crate3) (clear pallet10)
   changed: (fuel-cost) from 45 to 46
   goals met: 2 of 7
20. (load hoist2 crate3 truck0 depot2)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   changed: (current_load truck0) from 60 to 101
   goals met: 2 of 7
21. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 46 to 56
   goals met: 2 of 7
22. (unload hoist4 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist4)
   added: (lifting hoist4 crate3)
   changed: (current_load truck0) from 101 to 60
   goals met: 2 of 7
23. (drop hoist4 crate3 pallet4 distributor1)
   deleted: (lifting hoist4 crate3) (clear pallet4)
   added: (available hoist4) (at crate3 distributor1) (clear crate3) (on crate3 pallet4)
   goals met: 3 of 7
24. (unload hoist4 crate7 truck0 distributor1)
   deleted: (in crate7 truck0) (available hoist4)
   added: (lifting hoist4 crate7)
   changed: (current_load truck0) from 60 to 50
   goals met: 3 of 7
25. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 56 to 66
   goals met: 3 of 7
26. (drop hoist4 crate7 crate3 distributor1)
   deleted: (lifting hoist4 crate7) (clear crate3)
   added: (available hoist4) (at crate7 distributor1) (clear crate7) (on crate7 crate3)
   goals met: 4 of 7
27. (lift hoist0 crate5 crate2 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate2)
   added: (lifting hoist0 crate5) (clear crate2)
   changed: (fuel-cost) from 66 to 67
   goals met: 4 of 7
28. (load hoist0 crate5 truck1 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck1) (available hoist0)
   changed: (current_load truck1) from 41 to 122
   goals met: 4 of 7
29. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 67 to 77
   goals met: 4 of 7
30. (lift hoist0 crate2 pallet0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 pallet0)
   added: (lifting hoist0 crate2) (clear pallet0)
   changed: (fuel-cost) from 77 to 78
   goals met: 4 of 7
31. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   changed: (current_load truck0) from 50 to 83
   goals met: 4 of 7
32. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   changed: (current_load truck0) from 83 to 33
   goals met: 4 of 7
33. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 78 to 88
   goals met: 4 of 7
34. (unload hoist3 crate5 truck1 distributor0)
   deleted: (in crate5 truck1) (available hoist3)
   added: (lifting hoist3 crate5)
   changed: (current_load truck1) from 122 to 41
   goals met: 4 of 7
35. (drop hoist3 crate5 pallet9 distributor0)
   deleted: (lifting hoist3 crate5) (clear pallet9)
   added: (available hoist3) (at crate5 distributor0) (clear crate5) (on crate5 pallet9)
   goals met: 5 of 7
36. (unload hoist3 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist3)
   added: (lifting hoist3 crate2)
   changed: (current_load truck0) from 33 to 0
   goals met: 5 of 7
37. (drop hoist0 crate0 pallet0 depot0)
   deleted: (lifting hoist0 crate0) (clear pallet0)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 pallet0)
   goals met: 6 of 7
38. (drop hoist3 crate2 crate5 distributor0)
   deleted: (lifting hoist3 crate2) (clear crate5)
   added: (available hoist3) (at crate2 distributor0) (clear crate2) (on crate2 crate5)
   goals met: 7 of 7
